package naymchik.lesson4;
/** 3. Создать класс NumberDayLeapYear, в котором реализовать возможность ввести пользователю строковое значение и целое число
 месяц, день, соответственно, программа должна считать данные и по данным вывести порядковый день данного года,
 при этом учесть, что программа считает только ВИСОКОСНЫЙ год. в классе должен быть метод
 public static int getNumberDay (int day, string month ) - можно использовать дальше.
 УЧТИТЕ ПОЛЬЗОВАТЕЛЬ МОЖЕТ ВВЕСТИ МЕСЯЦ НЕТОЛЬКО МАЛЕньКИМи БУКВАМИ, поможет метод toLowerCase()
 * */
public class NumberDayLeapYear {
    public static void main(String[] args) {

    }
}
